دانشجویان که گردش دفاع آنها به پایان رسیده و الان در مرحله گردش فارغ التحصیلی هستند

دانشجویان این مرحله تمام مراحل دفاع و ملزومات رو تکمیل کردند


هات محمد صبري صبري
علي صالح ناصر ناصر
مصطفی نجم العبادة
ابراهیم عواد کاظم الجعباوي
سلطان علي یاسر الصافي
مصطفی منعم صالح صالح
کاظم حمد عزیز الغرابي
رامي صادق کریم الربیعي
علي حمزه جواد العجیلي
مسلم علاء حاکم العبودي
ابتهاج عبدالستار عبدالرحیم عبدالرحیم
غدیر عیسی خلیل خلیل
نور حیدر خیرالله خیرالله
علي غني حبیب الغزي
علي احمد مهدي مهدي
علي محمود عبد عبد
عمار جبار کشاش الشرماني
علی منیر حمزه الجورانی
احمد علی فلاح التمیمي
یاسر خضیر عباس التمیمي
مصطفی جاسم محمد الیاسري
عبدالله عبدالمنعم عاجل العمري
سجاد مصطفی محمد محمد
محمد رائد محمود محمود
محمد صبار سعید العباسي
عبدالله صلاح عبید الرماحي
احمد صائب زید الجنابي
یعقوب محمد یعقوب یعقوب
فلاح مجیل محمد محمد
جعفر کریم سلمان سلمان
مصطفی احمد محسن الکبیسي
قسور بریر هاشم الورد
نور الدین فلاح حسین العود
محمد جواد کاظم الشویل
عباس صلال صاحب الشکري
بلسم کریم حسن حسن
احمد ماجد خلیف خلیف
حیدر مکي محمدرضا الحضیري
سجاد علي ثامر الخفاجي
فاضل رحمن هاتف مرشدي
واثق غني عبد الصالحی
حسین عباس فاضل المحمد
جبار حمید حسین بیرماني
مالک جبار فشاخ فشاخ
احمد حرز سکوت ال یاسر
اخلاص عبدالامیر سوادي الغالب
حیدر راتب حمید حمید
حیدر احسان عبد علي هيكل
  احمد شعلان عدوان عدوان
غزوان فیصل هادي العوادي


حسین ابراهیم علي سواعد
حیدر طالب عباس عباس



______________________

دانشجویانی که در مرحله گردش دفاع هستند

محمد طارق اسماعیل اسماعیل
طیف حیدر نعومي نعومي
اسماء حسن کاطع کاطع
مهدي جاسم محمد الساعدي
عارف حسیب محمد محمد
فرهاد حسین علی ارکوازي
ذوالفقار ناصر غافل الفحام
محمد عبیس لعیبي النائلي
مرتضی غسان مجید محسن
سیف علي اسود الحسین
حسنین صبري شکر الجبوري
علي اتیلا اسماعیل الرفاعي
رسول محمد کاظم کاظم
محمد حسین حسن الجعباوي
شفاء حمزة حسین الدحیدحاوي
حسین عبدالکریم عبدالامیر التمیمي
احمد محمد فلیح المجیلي
ونس کاظم عبید المجبلي
بکر محمود علوان المعموري